Terraform Plan (preview)
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_authorizer.cognito_jwt will be updated in-place
  ~ resource "aws_apigatewayv2_authorizer" "cognito_jwt" {
        id                               = "cc47ip"
        name                             = "cognito-jwt"
        # (5 unchanged attributes hidden)

      ~ jwt_configuration {
          ~ audience = [
              - "65deq7q3ep2mk0kt7k1o9varh7",
            ] -> (known after apply)
          ~ issuer   = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_ozL9FkbCg" -> (known after apply)
        }
    }

  # aws_cognito_user_pool.mbm must be replaced
-/+ resource "aws_cognito_user_pool" "mbm" {
      ~ arn                        = "arn:aws:cognito-idp:us-east-1:217354297026:userpool/us-east-1_ozL9FkbCg" -> (known after apply)
      - auto_verified_attributes   = [] -> null
      ~ creation_date              = "2025-08-18T17:21:03Z" -> (known after apply)
      + custom_domain              = (known after apply)
      ~ domain                     = "mbm-app-7bf40330" -> (known after apply)
      ~ email_verification_message = "Your confirmation code is {####}" -> (known after apply)
      ~ email_verification_subject = "Meals by Maggie verification code" -> (known after apply)
      ~ endpoint                   = "cognito-idp.us-east-1.amazonaws.com/us-east-1_ozL9FkbCg" -> (known after apply)
      ~ estimated_number_of_users  = 7 -> (known after apply)
      ~ id                         = "us-east-1_ozL9FkbCg" -> (known after apply)
      ~ last_modified_date         = "2025-10-29T02:02:25Z" -> (known after apply)
        name                       = "mbm-user-pool"
      + sms_verification_message   = (known after apply)
      - tags                       = {} -> null
      ~ user_pool_tier             = "ESSENTIALS" -> (known after apply)
      ~ username_attributes        = [ # forces replacement
          + "email",
        ]
        # (3 unchanged attributes hidden)

      - account_recovery_setting {
          - recovery_mechanism {
              - name     = "verified_email" -> null
              - priority = 1 -> null
            }
          - recovery_mechanism {
              - name     = "verified_phone_number" -> null
              - priority = 2 -> null
            }
        }

      - admin_create_user_config {
          - allow_admin_create_user_only = false -> null
        }

      ~ lambda_config {
          + pre_token_generation = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ password_policy {
          - password_history_size            = 0 -> null
          ~ temporary_password_validity_days = 7 -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      - sign_in_policy {
          - allowed_first_auth_factors = [
              - "PASSWORD",
            ] -> null
        }

      - verification_message_template {
          - default_email_option = "CONFIRM_WITH_CODE" -> null
          - email_message        = "Your confirmation code is {####}" -> null
          - email_subject        = "Meals by Maggie verification code" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.spa must be replaced
-/+ resource "aws_cognito_user_pool_client" "spa" {
      ~ access_token_validity                         = 0 -> (known after apply)
      ~ auth_session_validity                         = 3 -> (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      ~ enable_propagate_additional_user_context_data = false -> (known after apply)
      ~ enable_token_revocation                       = true -> (known after apply)
      ~ id                                            = "65deq7q3ep2mk0kt7k1o9varh7" -> (known after apply)
      ~ id_token_validity                             = 0 -> (known after apply)
        name                                          = "mbm-spa-client"
      ~ read_attributes                               = [] -> (known after apply)
      ~ refresh_token_validity                        = 30 -> (known after apply)
      ~ user_pool_id                                  = "us-east-1_ozL9FkbCg" # forces replacement -> (known after apply) # forces replacement
      ~ write_attributes                              = [] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_cognito_user_pool_domain.mbm must be replaced
-/+ resource "aws_cognito_user_pool_domain" "mbm" {
      ~ aws_account_id                  = "217354297026" -> (known after apply)
      ~ cloudfront_distribution         = "d3oia8etllorh5.cloudfront.net" -> (known after apply)
      ~ cloudfront_distribution_arn     = "d3oia8etllorh5.cloudfront.net" -> (known after apply)
      ~ cloudfront_distribution_zone_id = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ id                              = "mbm-app-7bf40330" -> (known after apply)
      ~ managed_login_version           = 1 -> (known after apply)
      ~ s3_bucket                       = "aws-cognito-prod-iad-assets" -> (known after apply)
      ~ user_pool_id                    = "us-east-1_ozL9FkbCg" # forces replacement -> (known after apply) # forces replacement
      ~ version                         = "20250818172104" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_cognito_user_pool_ui_customization.mbm_spa will be updated in-place
  ~ resource "aws_cognito_user_pool_ui_customization" "mbm_spa" {
      ~ client_id          = "65deq7q3ep2mk0kt7k1o9varh7" -> (known after apply)
        id                 = "us-east-1_ozL9FkbCg,65deq7q3ep2mk0kt7k1o9varh7"
      ~ user_pool_id       = "us-east-1_ozL9FkbCg" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cognito_pre_signup must be replaced
-/+ resource "aws_lambda_permission" "allow_cognito_pre_signup" {
      ~ id                  = "AllowCognitoPreSignUp" -> (known after apply)
      ~ source_arn          = "arn:aws:cognito-idp:us-east-1:217354297026:userpool/us-east-1_ozL9FkbCg" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

Changes to Outputs:
  ~ cognito_issuer              = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_ozL9FkbCg" -> (known after apply)
  ~ cognito_user_pool_client_id = "65deq7q3ep2mk0kt7k1o9varh7" -> (known after apply)
  ~ cognito_user_pool_id        = "us-east-1_ozL9FkbCg" -> (known after apply)

```